<?php

use App\Models\Facultes;
use Illuminate\Database\Seeder;

class FacultesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $facultes = [
            ['Економічний факультет', 'Хаджинова Олена Вікторівна'],
            ['Енергетичний факультет', 'Саєнко Юрій Леонідович'],
            ['Кафедра військової підготовки', '-------------------'],
            ['Металургійний факультет', 'Тарасюк Леонід Іванович'],
            ['Соціально-гуманітарний факультет', 'Ірина Федорівна Марченко '],
            ['Факультет інженерної та мовної підготовки', 'Сагіров Юрій Георгійович'],
            ['Факультет інформаційних технологій', 'Михайло Вікторович Верескун'],
            ['Факультет машинобудування та зварювання', 'Володимир Васильович Суглобов'],
            ['Факультет транспортних технологій', '-------------'],
        ];

        foreach($facultes as $faculty){
            Facultes::create([
                'faculty_name' => $faculty[0],
                'head_faculty' => $faculty[1]
            ]);
        }
    }
}
